{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v2.3.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 768, 1024], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_0"}, "name": "input_0", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "35_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "35_pad", "inbound_nodes": [[["input_0", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "35", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "35", "inbound_nodes": [[["35_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "36", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "36", "inbound_nodes": [[["35", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "37_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "37_pad", "inbound_nodes": [[["36", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "37", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "37", "inbound_nodes": [[["37_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "38", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "38", "inbound_nodes": [[["37", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "39", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "39", "inbound_nodes": [[["38", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "40_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "40_pad", "inbound_nodes": [[["39", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "40", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "40", "inbound_nodes": [[["40_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "41", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "41", "inbound_nodes": [[["40", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "42_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "42_pad", "inbound_nodes": [[["41", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "42", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "42", "inbound_nodes": [[["42_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "43", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "43", "inbound_nodes": [[["42", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "44", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "44", "inbound_nodes": [[["43", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "45_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "45_pad", "inbound_nodes": [[["44", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "45", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "45", "inbound_nodes": [[["45_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "46", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "46", "inbound_nodes": [[["45", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "47_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "47_pad", "inbound_nodes": [[["46", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "47", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "47", "inbound_nodes": [[["47_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "48", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "48", "inbound_nodes": [[["47", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "49_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "49_pad", "inbound_nodes": [[["48", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "49", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "49", "inbound_nodes": [[["49_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "50", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "50", "inbound_nodes": [[["49", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "51", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_first"}, "name": "51", "inbound_nodes": [[["50", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "52_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "52_pad", "inbound_nodes": [[["51", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "52", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "52", "inbound_nodes": [[["52_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "53", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "53", "inbound_nodes": [[["52", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "54_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "54_pad", "inbound_nodes": [[["53", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "54", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "54", "inbound_nodes": [[["54_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "55", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "55", "inbound_nodes": [[["54", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "56_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "56_pad", "inbound_nodes": [[["55", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "56", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "56", "inbound_nodes": [[["56_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "57", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "57", "inbound_nodes": [[["56", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "58_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "58_pad", "inbound_nodes": [[["57", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "58", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "58", "inbound_nodes": [[["58_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "59", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "59", "inbound_nodes": [[["58", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "60_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "60_pad", "inbound_nodes": [[["59", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "60", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "60", "inbound_nodes": [[["60_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "61", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "61", "inbound_nodes": [[["60", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "62_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "62_pad", "inbound_nodes": [[["61", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "62", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "62", "inbound_nodes": [[["62_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "63", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "63", "inbound_nodes": [[["62", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "64_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "64_pad", "inbound_nodes": [[["63", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "64", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "64", "inbound_nodes": [[["64_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "65", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "65", "inbound_nodes": [[["64", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "66_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "66_pad", "inbound_nodes": [[["65", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "66", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "66", "inbound_nodes": [[["66_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "67", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "67", "inbound_nodes": [[["66", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "68_pad", "trainable": true, "dtype": "float32", "padding": [[2, 2], [2, 2]], "data_format": "channels_first"}, "name": "68_pad", "inbound_nodes": [[["67", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "68", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [2, 2], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "68", "inbound_nodes": [[["68_pad", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "69", "trainable": true, "dtype": "float32", "activation": "relu"}, "name": "69", "inbound_nodes": [[["68", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "output_0", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "output_0", "inbound_nodes": [[["69", 0, 0, {}]]]}], "input_layers": [["input_0", 0, 0]], "output_layers": [["output_0", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of16.bin", "group1-shard2of16.bin", "group1-shard3of16.bin", "group1-shard4of16.bin", "group1-shard5of16.bin", "group1-shard6of16.bin", "group1-shard7of16.bin", "group1-shard8of16.bin", "group1-shard9of16.bin", "group1-shard10of16.bin", "group1-shard11of16.bin", "group1-shard12of16.bin", "group1-shard13of16.bin", "group1-shard14of16.bin", "group1-shard15of16.bin", "group1-shard16of16.bin"], "weights": [{"name": "35/kernel", "shape": [3, 3, 3, 64], "dtype": "float32"}, {"name": "35/bias", "shape": [64], "dtype": "float32"}, {"name": "37/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "37/bias", "shape": [64], "dtype": "float32"}, {"name": "40/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "40/bias", "shape": [128], "dtype": "float32"}, {"name": "42/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "42/bias", "shape": [128], "dtype": "float32"}, {"name": "45/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "45/bias", "shape": [256], "dtype": "float32"}, {"name": "47/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "47/bias", "shape": [256], "dtype": "float32"}, {"name": "49/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "49/bias", "shape": [256], "dtype": "float32"}, {"name": "52/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "52/bias", "shape": [512], "dtype": "float32"}, {"name": "54/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "54/bias", "shape": [512], "dtype": "float32"}, {"name": "56/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "56/bias", "shape": [512], "dtype": "float32"}, {"name": "58/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "58/bias", "shape": [512], "dtype": "float32"}, {"name": "60/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "60/bias", "shape": [512], "dtype": "float32"}, {"name": "62/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "62/bias", "shape": [512], "dtype": "float32"}, {"name": "64/kernel", "shape": [3, 3, 512, 256], "dtype": "float32"}, {"name": "64/bias", "shape": [256], "dtype": "float32"}, {"name": "66/kernel", "shape": [3, 3, 256, 128], "dtype": "float32"}, {"name": "66/bias", "shape": [128], "dtype": "float32"}, {"name": "68/kernel", "shape": [3, 3, 128, 64], "dtype": "float32"}, {"name": "68/bias", "shape": [64], "dtype": "float32"}, {"name": "output_0/kernel", "shape": [1, 1, 64, 1], "dtype": "float32"}, {"name": "output_0/bias", "shape": [1], "dtype": "float32"}]}]}